# WidthOrDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..WidthOrDiameter Property
DuctPressureDropData Class See Also
---
The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double WidthOrDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WidthOrDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double WidthOrDiameter {
	double get ();
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace